projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ЦенообразованиеКодовCMR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦенообразованиеКодовCMR</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаПервуюCMR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаДополнительнуюCMR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоБесплатныхКодов</Name>
					<Comment>Количество бесплатных кодов для каждой CMR</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУслугОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ЦенообразованиеКодовCMR/Ext/ManagerModule.bsl
Функция ТабличныйДокументЦенВывод(СтруктураПараметров, КодЯзыка="ru", ТекстЗаголовка="", ДатаЦен=Неопределено, Валюта=Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РегистрыСведений.ЦенообразованиеКодовCMR.ПолучитьМакет("Макет");
	
	пКонтрагент = СтруктураПараметров.Контрагент;
	пПринципал 	= ?(ТипЗнч(СтруктураПараметров.Принципал) = ТИП("СправочникСсылка.Принципал"), СтруктураПараметров.Принципал.ПринципалУстановкиЦен, СтруктураПараметров.Принципал);
	пУслуга		= СтруктураПараметров.УслугаОрганизации;
		
	Если ДатаЦен = Неопределено Тогда
		пДатаЦен= ТекущаяДатаСеанса();
	Иначе
		пДатаЦен= ДатаЦен;
	КонецЕсли;
	
	Валюта 		= Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенообразованиеУслугиСрезПоследних.Период КАК Период,
		//|	ЦенообразованиеУслугиСрезПоследних.Принципал КАК Принципал,
		//|	ЦенообразованиеУслугиСрезПоследних.Контрагент КАК Контрагент,
		//|	ЦенообразованиеУслугиСрезПоследних.УслугаОрганизации КАК УслугаОрганизации,
		//|	ЦенообразованиеУслугиСрезПоследних.ЦенаУслуги КАК ЦенаУслуги,
		|	ЦенообразованиеУслугиСрезПоследних.ЦенаЗаПервуюCMR КАК ЦенаЗаПервуюCMR,
		|	ЦенообразованиеУслугиСрезПоследних.ЦенаЗаДополнительнуюCMR КАК ЦенаЗаДополнительнуюCMR,
		|	ЦенообразованиеУслугиСрезПоследних.ЦенаЗаДополнительныйКод КАК ЦенаЗаДополнительныйКод,
		|	ЦенообразованиеУслугиСрезПоследних.КоличествоБесплатныхКодов КАК КоличествоБесплатныхКодов,
		|	ЦенообразованиеУслугиСрезПоследних.Валюта КАК Валюта,
		|	ЦенообразованиеУслугиСрезПоследних.Ответственный КАК Ответственный,
		|	ЦенообразованиеУслугиСрезПоследних.ДатаУстановки КАК ДатаУстановки
		|ИЗ
		|	РегистрСведений.ЦенообразованиеКодовCMR.СрезПоследних(
		|			&Дата,
		|			Контрагент = &Контрагент) КАК ЦенообразованиеУслугиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"						, ДатаЦен);
	Запрос.УстановитьПараметр("Контрагент"					, пКонтрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		пДатаЦен 			= Выборка.Период;
		Валюта				= Выборка.Валюта;
	КонецЕсли;
		
	пТекстВалюта = "";
	Если ЗначениеЗаполнено(Валюта) Тогда
		пТекстВалюта = ?(ЗначениеЗаполнено(Валюта.МеждународноеОбозначение), СокрЛП(Валюта.МеждународноеОбозначение), СокрЛП(Валюта));
	КонецЕсли;
	
	Если ТекстЗаголовка = "" Тогда
		Если НЕ пКонтрагент.Пустая() Тогда
			пТекстЗаголовка = НСтр("ru='Цены контрагента ';uk='Ціни контрагента ';en='Customer prices: '", КодЯзыка) + СокрЛП(пКонтрагент.НаименованиеПолное) + Символы.ПС 
								+ НСтр("ru='Услуга: ';uk='Послуга: ';en='Service: '", КодЯзыка) + СокрЛП(пУслуга)
								+ ?(пДатаЦен = Неопределено, "", ?(КодЯзыка = "en", " (" + Формат(пДатаЦен, "Л=en; ДФ=dd/MM/yyyy") + ")", НСтр("ru=' (от ';uk=' (від '", КодЯзыка) + Формат(пДатаЦен, "ДФ=dd.MM.yyyy") + НСтр("ru=' г.';uk=' р.'", КодЯзыка) + ")"))
								+ ?(ЗначениеЗаполнено(пТекстВалюта), НСтр("ru=' (в ';uk=' (в ';en=' ('", КодЯзыка) + СокрЛП(пТекстВалюта) + ")", "");
		Иначе  // Принципал
			пТекстЗаголовка = НСтр("ru='Цены принципала ';uk='Ціни принципала ';en='Principal prices: '", КодЯзыка) + СокрЛП(пПринципал.Наименование) + Символы.ПС 
								+ НСтр("ru='Услуга: ';uk='Послуга: ';en='Service: '", КодЯзыка) + СокрЛП(пУслуга)
								+ ?(пДатаЦен = Неопределено, "", ?(КодЯзыка = "en", " (" + Формат(пДатаЦен, "Л=en; ДФ=dd/MM/yyyy") + ")", НСтр("ru=' (от ';uk=' (від '", КодЯзыка) + Формат(пДатаЦен, "ДФ=dd.MM.yyyy") + НСтр("ru=' г.';uk=' р.'", КодЯзыка) + ")"))
								+ ?(ЗначениеЗаполнено(пТекстВалюта), НСтр("ru=' (в ';uk=' (в ';en=' ('", КодЯзыка) + СокрЛП(пТекстВалюта) + ")", "");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(пТекстВалюта) Тогда
			пТекстЗаголовка = ТекстЗаголовка + НСтр("ru=' (в ';uk=' (в ';en=' ('", КодЯзыка) + СокрЛП(пТекстВалюта) + ")";
		Иначе
			пТекстЗаголовка = ТекстЗаголовка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пТекстЗаголовка) Тогда
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОблЗаголовок.Параметры.ТекстЗаголовка = пТекстЗаголовка;
		ТабДок.Вывести(ОблЗаголовок);
	Иначе
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
		ТабДок.Вывести(ОблЗаголовок);
	КонецЕсли;
	
	// вывод
	ОблШапкаНачало = Макет.ПолучитьОбласть("ШапкаНачало");
	ТабДок.Вывести(ОблШапкаНачало);	
	
	ОблШапкаЗначение = Макет.ПолучитьОбласть("ШапкаЗначение");
	
	ОблШапкаЗначение.Параметры.Заголовок = НСтр("ru='Цена за первую CMR';uk='Ціна за першу CMR';en='Price for the first CMR'", КодЯзыка);
	ТабДок.Присоединить(ОблШапкаЗначение);
	
	ОблШапкаЗначение.Параметры.Заголовок = НСтр("ru='Цена за доп. CMR';uk='Ціна за дод. CMR';en='Price for add. CMR'", КодЯзыка);
	ТабДок.Присоединить(ОблШапкаЗначение);
	
	ОблШапкаЗначение.Параметры.Заголовок = НСтр("ru='Цена за доп. код';uk='Ціна за доп. код';en='Price for add. code'", КодЯзыка);
	ТабДок.Присоединить(ОблШапкаЗначение);
	
	ОблШапкаЗначение.Параметры.Заголовок = НСтр("ru='Кол-во б/п кодов';uk='Кіл-сть б/к кодів';en='qty. of free codes'", КодЯзыка);
	ТабДок.Присоединить(ОблШапкаЗначение);
	
	ОблШапкаКонец = Макет.ПолучитьОбласть("ШапкаКонец");
	ТабДок.Присоединить(ОблШапкаКонец);
	
	ОблСтрокаНачало = Макет.ПолучитьОбласть("СтрокаНачало");
	ТабДок.Вывести(ОблСтрокаНачало);	
	
	ОблСтрокаЗначение = Макет.ПолучитьОбласть("СтрокаЗначение");
	
	ОблСтрокаЗначение.Параметры.Цена = Формат(Выборка.ЦенаЗаПервуюCMR, "ЧРД=.");
	ТабДок.Присоединить(ОблСтрокаЗначение);
	
	ОблСтрокаЗначение.Параметры.Цена = Формат(Выборка.ЦенаЗаДополнительнуюCMR, "ЧРД=.");
	ТабДок.Присоединить(ОблСтрокаЗначение);
	
	ОблСтрокаЗначение.Параметры.Цена = Формат(Выборка.ЦенаЗаДополнительныйКод, "ЧРД=.");
	ТабДок.Присоединить(ОблСтрокаЗначение);
	
	ОблСтрокаЗначение.Параметры.Цена = Формат(Выборка.КоличествоБесплатныхКодов, "ЧДЦ=0; ЧРД=.");
	ТабДок.Присоединить(ОблСтрокаЗначение);
	
	ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонец");
	ТабДок.Присоединить(ОблСтрокаКонец);
	
	ОблПодвалНачало = Макет.ПолучитьОбласть("ПодвалНачало");
	ТабДок.Вывести(ОблПодвалНачало);	
	
	ОблПодвалЗначение = Макет.ПолучитьОбласть("ПодвалЗначение");
	ТабДок.Присоединить(ОблПодвалЗначение);
	ТабДок.Присоединить(ОблПодвалЗначение);
	ТабДок.Присоединить(ОблПодвалЗначение);
	ТабДок.Присоединить(ОблПодвалЗначение);
	
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ТолькоПросмотр 	= Истина;
	
	Возврат ТабДок;
	
КонецФункции
